gr82morozr/esp32_remote_control/src/esp32_rc.cpp
#include "esp32_rc.h"

// Static member initialization
int ESP32RemoteControl::metrics_line_count_ = 0;

// Global metrics configuration (default enabled)
bool rc_metrics_enabled = true;

/**
 * @brief Constructor for ESP32RemoteControl base class
 * 
 * Initializes the core remote control framework including FreeRTOS primitives,
 * message queues, heartbeat timer, and background tasks. This constructor sets up
 * the foundation for all protocol-specific implementations.
 * 
 * @param fast_mode Operating mode selection:
 *   - false (default): Reliable mode with queue depth of 10 messages
 *   - true: Low-latency mode with queue depth of 1 (may drop messages)
 * 
 * Initialization sequence:
 * 1. Creates recursive mutex for thread-safe access
 * 2. Sets up send/receive message queues (size depends on fast_mode)
 * 3. Creates heartbeat timer (100ms interval by default)
 * 4. Starts background task for queue processing
 * 5. Initializes connection state and peer addressing
 * 
 * Example usage:
 *   ESP32RemoteControl* controller = new ESP32_RC_ESPNOW(false);  // Reliable
 *   ESP32RemoteControl* controller = new ESP32_RC_WIFI(true);     // Low-latency
 */
ESP32RemoteControl::ESP32RemoteControl(bool fast_mode) : fast_mode_(fast_mode) {

  LOG("Initializing...");
  conn_state_ = RCConnectionState_t::DISCONNECTED;
  memset(peer_addr_, 0, RC_ADDR_SIZE);
  
  // Initialize generic addresses (simplified)
  memset(peer_address_, 0, RC_ADDR_SIZE);
  memset(my_address_, 0, RC_ADDR_SIZE);



  // fast mode is false, then queue lenth is 10, otherwise 1
  data_lock_ = xSemaphoreCreateRecursiveMutex();
  if (!data_lock_) {
    LOG_ERROR("Failed to create data lock semaphore!");
    SYS_HALT;
  }
  
  // Create receive queue with fixed length of 10 messages
  // This queue is used to receive messages from the protocol layer
  queue_send_ = xQueueCreate(fast_mode_ ? 1 : QUEUE_DEPTH_SEND, sizeof(RCMessage_t));
  queue_recv_ = xQueueCreate(fast_mode_ ? 1 : QUEUE_DEPTH_RECV, sizeof(RCMessage_t));


  // Check if queues were created successfully
  if (!queue_send_ || !queue_recv_) {
    LOG_ERROR("Failed to create message queues!");
    cleanupResources();
    SYS_HALT;
  }

  // set heartbeat timer
  
  if (!timer_heartbeat_) {
    timer_heartbeat_ = xTimerCreate(
        "HeartbeatTimer", pdMS_TO_TICKS(heartbeat_interval_ms_),
        pdTRUE,  // auto-reload
        this,    // timer ID (optional, for static->member mapping)
        &ESP32RemoteControl::heartbeatTimerCallback  // static function
    );
  }
  if (!timer_heartbeat_) {
    LOG_ERROR("Failed to create heartbeat timer!");
    cleanupResources();
    SYS_HALT;
  }
  LOG("Heartbeat Timer created.");
    

  // start the sendFromQueueTask
  
  send_task_running_ = true;
  BaseType_t taskCreated = xTaskCreatePinnedToCore(
      ESP32RemoteControl::sendFromQueueLoop,  // Static task wrapper
      "SendTask", 4096,
      this,  // Pass the instance
      3, 
      &sendFromQueueTaskHandle_, 
      APP_CPU_NUM
  );

  LOG("SendFromQueueTask created.");

  if (taskCreated != pdPASS || sendFromQueueTaskHandle_ == nullptr) {
    LOG_ERROR("Failed to create SendFromQueueTask");
    send_task_running_ = false;
    cleanupResources();
    SYS_HALT;
  } else {
    xTaskNotifyGive(sendFromQueueTaskHandle_); // Notify the task to start immediately
  }
  LOG("Initialization complete.");
}

/**
 * @brief Destructor for ESP32RemoteControl base class
 * 
 * Cleanly shuts down all FreeRTOS resources including timers, semaphores,
 * and message queues. Ensures no resource leaks when controller is destroyed.
 * 
 * Cleanup sequence:
 * 1. Stops and deletes heartbeat timer
 * 2. Deletes recursive mutex
 * 3. Deletes send and receive message queues
 * 4. Background task cleanup handled by FreeRTOS
 */
ESP32RemoteControl::~ESP32RemoteControl() {
  cleanupResources();
}

void ESP32RemoteControl::cleanupResources() {
  if (sendFromQueueTaskHandle_) {
    send_task_running_ = false;
    xTaskNotifyGive(sendFromQueueTaskHandle_);

    for (uint8_t i = 0; i < 20 && sendFromQueueTaskHandle_; i++) {
      vTaskDelay(pdMS_TO_TICKS(1));
    }

    if (sendFromQueueTaskHandle_) {
      vTaskDelete(sendFromQueueTaskHandle_);
      sendFromQueueTaskHandle_ = nullptr;
    }
  }
  if (timer_heartbeat_) {
    xTimerStop(timer_heartbeat_, 0);
    xTimerDelete(timer_heartbeat_, 0);
    timer_heartbeat_ = nullptr;
  }
  if (data_lock_) {
    vSemaphoreDelete(data_lock_);
    data_lock_ = nullptr;
  }
  if (queue_send_) {
    vQueueDelete(queue_send_);
    queue_send_ = nullptr;
  }
  if (queue_recv_) {
    vQueueDelete(queue_recv_);
    queue_recv_ = nullptr;
  }
}

/**
 * @brief Initiate connection process for the remote control protocol
 * 
 * Starts the heartbeat mechanism and sets connection state to CONNECTING.
 * This method should be called after controller initialization to begin
 * communication attempts.
 * 
 * Connection flow:
 * 1. Starts heartbeat timer (begins sending periodic heartbeat messages)
 * 2. Sets state to CONNECTING
 * 3. Protocol-specific connection logic handled in derived classes
 * 4. State transitions to CONNECTED when peer responds
 * 
 * Example usage:
 *   controller->connect();  // Start attempting to connect
 *   while (controller->getConnectionState() != RCConnectionState_t::CONNECTED) {
 *     delay(100);  // Wait for connection establishment
 *   }
 */
void ESP32RemoteControl::connect() {
  // Start the heartbeat timer
  if (timer_heartbeat_ && !xTimerIsTimerActive(timer_heartbeat_)) {
    xTimerStart(timer_heartbeat_, 0);
    LOG("Heartbeat Timer started");
  }

  // Set the connection state to CONNECTING
  conn_state_ = RCConnectionState_t::CONNECTING;
  LOG("Starting connection process...");
}


/**
 * @brief Set custom callback function for received messages
 * 
 * Registers a user-defined function to be called whenever a valid data message
 * is received and successfully queued. Useful for immediate message processing
 * or custom logging.
 * 
 * @param cb Function pointer to callback with signature: void func(const RCMessage_t& msg)
 *           Pass nullptr to disable callback
 * 
 * Example usage:
 *   void myMessageHandler(const RCMessage_t& msg) {
 *     Serial.println("Received message!");
 *   }
 *   controller->setOnReceiveMsgHandler(myMessageHandler);
 * 
 * Note: Callback executes in protocol context - keep processing minimal
 */
void ESP32RemoteControl::setOnReceiveMsgHandler(recv_cb_t cb) {
  // Set the custom callback for received messages - FINAL implementation
  recv_callback_ = cb;
}

void ESP32RemoteControl::setOnRecieveMsgHandler(recv_cb_t cb) {
  setOnReceiveMsgHandler(cb);
}

/**
 * @brief Set callback function for peer discovery events
 * 
 * Registers a callback function that will be called whenever a peer device is discovered.
 * This is useful for automatic pairing, connection management, or UI updates.
 * 
 * @param cb Function pointer to discovery callback, or nullptr to disable
 * 
 * Callback signature: void callback(const RCDiscoveryResult_t& result)
 * 
 * Example usage:
 *   void onPeerFound(const RCDiscoveryResult_t& result) {
 *     Serial.printf("Found peer: %s\n", result.info);
 *   }
 *   controller->setOnDiscoveryHandler(onPeerFound);
 * 
 * Note: Callback executes in protocol context - keep processing minimal
 */
void ESP32RemoteControl::setOnDiscoveryHandler(discovery_cb_t cb) {
  // Set discovery callback - FINAL implementation
  discovery_callback_ = cb;
}

/**
 * @brief Get current connection state
 * 
 * @return Current connection state:
 *   - DISCONNECTED: No peer communication
 *   - CONNECTING: Attempting to establish connection
 *   - CONNECTED: Active peer communication
 *   - ERROR: Connection error occurred
 * 
 * Example usage:
 *   if (controller->getConnectionState() == RCConnectionState_t::CONNECTED) {
 *     // Safe to send data
 *   }
 */
RCConnectionState_t ESP32RemoteControl::getConnectionState() const {
  // Get current connection state - FINAL implementation
  return conn_state_;
}

/**
 * @brief Process received messages with heartbeat and data handling
 * 
 * Central message processing hub that handles both heartbeat responses and
 * data messages. Any received message resets the heartbeat timeout, treating
 * data messages as implicit heartbeat responses for efficiency.
 * 
 * @param msg Received and validated message structure
 * 
 * Processing flow:
 * 1. Updates heartbeat timestamp (any message = alive peer)
 * 2. Establishes connection if not already connected
 * 3. Queues data messages for user consumption
 * 4. Calls user callback if registered
 * 5. Updates receive metrics
 * 
 * Message routing:
 * - HEARTBEAT: Only updates connection state (no queuing)
 * - DATA: Queued for recvData() and triggers callback
 * 
 * Thread safety: Uses recursive mutex for connection state updates
 */
void ESP32RemoteControl::onDataReceived(const RCMessage_t& msg) {
  LOG_DEBUG("Received message of type: %d", msg.type);

