gr82morozr/esp32_remote_control/src/esp32_rc.cpp
  self->sendFromQueueTaskHandle_ = nullptr;
  vTaskDelete(nullptr);
}

/**
 * @brief Print comprehensive metrics for protocol analysis
 * 
 * Displays real-time communication statistics including success rates,
 * connection state, and performance metrics. Designed for protocol
 * comparison and system health monitoring.
 * 
 * @param forceHeader If true, always print header regardless of line count
 * 
 * Output format:
 * - Time: Seconds since startup
 * - Protocol: ESPNOW/WIFI/BLE/NRF24
 * - Conn: Connection state (CONN/DISC/CONN?/ERR)  
 * - Send: Successful/Failed/Success rate %/Transactions per second
 * - Recv: Successful/Failed/Success rate %/Transactions per second
 * - Total: Cumulative sent/received counts
 * 
 * Example output:
 *   Time(s) | Protocol | Conn | Send(OK/Fail/Rate/TPS) | Recv(OK/Fail/Rate/TPS) | Total(Sent/Recv)
 *        45 |  ESPNOW  | CONN | 42/ 3/ 93%/12.3 | 38/ 0/100%/11.2 |   45/  38
 * 
 * When metrics are globally disabled, shows warning message every 5 seconds:
 *   ⚠️  METRICS DISABLED - Use ESP32RemoteControl::enableGlobalMetrics(true) to enable
 */
void ESP32RemoteControl::printMetrics(bool forceHeader) {
  unsigned long now = millis();
  
  // Check if metrics display is enabled and interval has elapsed
  if (!forceHeader && metrics_display_enabled_) {
    if (now - last_metrics_print_ms_ < metrics_interval_ms_) {
      return;  // Not time to print yet
    }
    last_metrics_print_ms_ = now;
  }
  
  // Check if global metrics are disabled
  if (!rc_metrics_enabled) {
    // Print warning message periodically when metrics are disabled
    static uint32_t last_warning_ms = 0;
    if (now - last_warning_ms >= 5000) {  // Show warning every 5 seconds
      last_warning_ms = now;
      LOG("⚠️  METRICS DISABLED - Use ESP32RemoteControl::enableGlobalMetrics(true) to enable");
    }
    return;
  }
  
  // Print header every 20 lines for readability or when forced
  if (forceHeader || metrics_line_count_ % 20 == 0) {
    LOG("=== Protocol Communication Metrics ===");
    LOG("Time(s) | Protocol | Conn | Send(OK/Fail/Rate/TPS) | Recv(OK/Fail/Rate/TPS) | Total(Sent/Recv)");
    LOG("--------|----------|------|------------------------|------------------------|------------------");
    metrics_line_count_ = 0;
  }
  
  // Get protocol name
  const char* protocolName = "UNKNOWN";
  switch (getProtocol()) {
    case RC_PROTO_ESPNOW: protocolName = "ESPNOW"; break;
    case RC_PROTO_WIFI: protocolName = "WIFI"; break;
    case RC_PROTO_BLE: protocolName = "BLE"; break;
    case RC_PROTO_NRF24: protocolName = "NRF24"; break;
  }
  
  // Connection state string
  const char* connState = "DISC";
  switch (conn_state_) {
    case RCConnectionState_t::CONNECTED: connState = "CONN"; break;
    case RCConnectionState_t::CONNECTING: connState = "CONN?"; break;
    case RCConnectionState_t::DISCONNECTED: connState = "DISC"; break;
    case RCConnectionState_t::ERROR: connState = "ERR"; break;
  }
  
  // Calculate transmission rates
  float sendRate = send_metrics_.getTransactionRate();
  float recvRate = recv_metrics_.getTransactionRate();
  
  // Print metrics with transmission rates
  LOG("%7lu | %8s | %4s | %3u/%3u/%3.0f%%/%4.1f | %3u/%3u/%3.0f%%/%4.1f | %4u/%4u",
      now / 1000,                           // Time in seconds
      protocolName,                         // Protocol name
      connState,                            // Connection state
      send_metrics_.successful,             // Send successful
      send_metrics_.failed,                 // Send failed  
      send_metrics_.getSuccessRate(),       // Send success rate %
      sendRate,                             // Send rate (TPS)
      recv_metrics_.successful,             // Receive successful
      recv_metrics_.failed,                 // Receive failed
      recv_metrics_.getSuccessRate(),       // Receive success rate %
      recvRate,                             // Receive rate (TPS)
      send_metrics_.getTotal(),             // Total sent
      recv_metrics_.getTotal()              // Total received
  );
  
  metrics_line_count_++;
}

/**
 * @brief Enable automatic metrics display with specified interval
 * 
 * Enables periodic metrics printing for continuous monitoring.
 * Call this method once to start automatic metrics display,
 * then call printMetrics() regularly in your main loop.
 * 
 * @param enable True to enable automatic display, false to disable
 * @param interval_ms Display interval in milliseconds (default: 1000ms)
 * 
 * Usage example:
 *   controller->enableMetricsDisplay(true, 2000);  // Print every 2 seconds
 *   // In main loop:
 *   controller->printMetrics();  // Will print based on interval
 */
void ESP32RemoteControl::enableMetricsDisplay(bool enable, uint32_t interval_ms) {
  metrics_display_enabled_ = enable;
  metrics_interval_ms_ = interval_ms;
  if (enable) {
    last_metrics_print_ms_ = millis();  // Reset timer
    LOG("Metrics display enabled (interval: %lu ms, protocol: %d)", interval_ms, getProtocol());
  } else {
    LOG("Metrics display disabled");
  }
}

/**
 * @brief Enable or disable global metrics calculation
 * 
 * Controls whether metrics are calculated across all controller instances.
 * When disabled, all metrics operations become no-ops for performance.
 * 
 * @param enable True to enable metrics calculation, false to disable
 * 
 * Usage example:
 *   ESP32RemoteControl::enableGlobalMetrics(true);   // Enable metrics
 *   ESP32RemoteControl::disableGlobalMetrics();      // Disable metrics
 * 
 * Note: This affects all controller instances globally
 */
void ESP32RemoteControl::enableGlobalMetrics(bool enable) {
  rc_metrics_enabled = enable;
  LOG("Global metrics calculation %s", enable ? "ENABLED" : "DISABLED");
}
